In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Titanic_dataset.csv')

In [3]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

Calculates the average age of passengers who survived.

In [5]:
deceased = df[df['Survived']==1]
average_age_deceased = deceased['Age'].mean()

print(average_age_deceased)

28.343689655172415

Find the average and median ticket prices of passengers who did not survive the disaster.

In [ ]:
deceased = df[df['Survived']== 0]
sum_fare_deceased = deceased['Fare'].sum()
medyan_fare_deceased = deceased['Fare'].median()

print(f"Sum of ticket prices: {sum_fare_deceased}, Median of ticket prices : {medyan_fare_deceased}")

Sum of ticket prices: 12142.7199, Median of ticket prices : 10.5

Find the average age of males who did not survive the disaster.

In [ ]:
deceased = df[(df['Survived']== 0 )& (df['Sex']== 'male')]
average_age_deceased_male = deceased['Age'].mean()
print(average_age_deceased_male)

31.618055555555557

Find the average age of females who did not survive the disaster.

In [ ]:
deceased = df[(df['Survived']== 0 )& (df['Sex']== 'female')]
average_age_deceased_female = deceased['Age'].mean()
print(average_age_deceased_female)

25.046875

Find the average age of passengers who survived the disaster.

In [24]:
deceased = df[df['Survived']== 1]
average_age = deceased['Age'].mean()
print(average_age)

28.343689655172415

Find the average ticket price of passengers who survived the disaster.

In [ ]:
deceased = df[df['Survived']== 1]
average_fare_survivors = deceased['Fare'].mean()
print(average_fare_survivors)

48.39540760233918

Find the total number of passengers who survived the disaster…  
(hint: you can use the code `len(df_titanic[(df_titanic.Survived==1)])` to find this number.)

In [26]:
deceased = df[df['Survived']== 1]
print(len(deceased))

342

Find the median ticket price of passengers under 10 years old.

In [ ]:
deceased = df[df['Age'] < 10]
average_age_fare = deceased['Fare'].mean()
print(average_age_fare)

30.576679032258067

Compare the average and median ticket prices of 1st class, 2nd class, and 3rd class. (The `Pclass` variable contains the classes.)

In [28]:
fare_stats = df.groupby('Pclass')['Fare'].agg(['mean', 'median']).reset_index()
print(fare_stats)

   Pclass       mean   median
0       1  84.154687  60.2875
1       2  20.662183  14.2500
2       3  13.675550   8.0500

Compare the ratio of women who died in the disaster to the ratio of men who died. (For example, for men: the ratio is calculated by dividing the number of men who died by the total number of men.)

In [29]:
total_by_sex = df['Sex'].value_counts()
deceased_by_sex = df[df['Survived'] == 0]['Sex'].value_counts()
death_ratio = deceased_by_sex / total_by_sex
print(death_ratio)

Sex
male      0.811092
female    0.257962
Name: count, dtype: float64